# Case Study on Measures of Central Tendency and Dispersion

In [5]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [8]:
data = pd.read_csv('StudentsPerformance.csv')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

Find out how many males and females participated in the test.

In [10]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [11]:
data.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [12]:
data.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [20]:
# males and females participated in the test
data.groupby('gender')['race/ethnicity'].count()

gender
female    518
male      482
Name: race/ethnicity, dtype: int64

What do you think about the students' parental level of education?

In [31]:

df_ple = data.groupby('parental level of education')['race/ethnicity'].describe()
df_ple

                            count unique     top freq
parental level of education
associate's degree            222      2  female  116
bachelor's degree             118      2  female   63
high school                   196      2    male  102
master's degree                59      2  female   36
some college                  226      2  female  118
some high school              179      2  female   91

Who scores the most on average for math, reading and writing based on
● Gender
● Test preparation course

In [44]:
data[['test preparation course',
      'gender',
      'math score',
      'writing score',
      'reading score']].groupby(['test preparation course','gender']).agg('mean')

                                math score  writing score  reading score
test preparation course gender
completed               female   67.108696      78.793478      77.375000
                        male     72.988506      70.339080      70.793103
none                    female   61.320359      68.982036      69.955090
                        male     66.467532      59.551948      62.581169

What do you think about the scoring variation for math, reading and writing
based on
● Gender
● Test preparation course

In [47]:
data[['test preparation course',
      'gender',
      'math score',
      'writing score',
      'reading score']].groupby(['test preparation course','gender']).var()

                                math score  writing score  reading score
test preparation course gender
completed               female  208.173913     149.836897     161.175546
                        male    197.098133     166.098233     185.297987
none                    female  272.602767     225.495172     214.241220
                        male    205.513600     181.394687     184.843553

The management needs your help to give bonus points to the top 25% of
students based on their maths score, so how will you help the management
to achieve this.

In [66]:
x = print(df.sort_values(by=['math score'],ascending=False))

     math score
999         100
996         100
515         100
517         100
516         100
..          ...
2            18
51           13
3            11
1             8
0             0

[1000 rows x 1 columns]